from transformers   import pipeline
# pip install transformer==5.20.2
#다운그레이드
#pip install transformers==4.57.6

# 1. 요약 파이프라인 생성(모델 변경)
summarizer = pipeline("summarization", model="digit82/kobart-summarization")

# 2. 요약할 원문
text = """무라카미 하루키가 3년 만에 선보인 신작 장편 『가호』의 한국어판이 10월 정식 출간된다.
        2026년 7월 현지 발매 후 4일 만에 발행 부수 30만 부를 기록하고 주요 서점 베스트셀러에 등극하며 거장 하루키의 힘을 보여주었고,
        현지에서는 전작 『도시와 그 불확실한 벽』의 기록을 넘어설 것으로 예상하고 있다.
        이번 신작 『가호』는 무라카미 하루키가 ‘여성을 단독 주인공으로 그린 최초의 소설’로 화제가 되었다.
        현실과 비현실의 경계를 오가는 기존의 견고한 세계관을 유지하면서, 그간 그의 소설 가운데 가장 쉽고 재미있으며 스릴 넘치는 작품이라는 현지 독자들의 호평이 이어졌다.
        오랜 세월 하루키를 읽어온 독자에게는 ‘한층 새롭고 유쾌한 하루키와의 만남’이 되고,
        그간 그의 작품을 제대로 접해보지 못한 독자에게는 ‘하루키 입문을 위한 즐거운 길잡이’가 될 것이다.
       """

# 3. 요약 실행
summary = summarizer(
    text,
    min_length=20,
    max_length=60,
    do_sample=False
)

# 4. 결과 텍스트로 추출 --> 출력
sum_text = summary[0]['summary_text']
print(f"요약된 문장 : {sum_text}")
# 요약된 문장 : 무라카미 하루키가 3년 만에 선보인 신작 장편 『가호』는 무라카미 하루키가 ‘여성을 단독 주인공으로 그린 최초의 소설’로 화제가 되었을 뿐,
#              그의 소설 가운데 가장 쉽고 재미있으며 스릴 넘치는 작품이라는 현지 독자들의 호평이